Repository: uslanozan/EcoMarket
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Address
tr: Adres

source: Add Product
tr: Ürün Ekle

# alreadyHaveAccount
source: Already have an account?
tr: Zaten hesabınız var mı?

# answeredAllQuestions
source: Congratulations! You answered all the questions.
tr: Tebrikler! Tüm soruları yanıtladınız.

# apiResponseNotJson
source: API response is not in a valid JSON format.
tr: API yanıtı geçerli bir JSON formatında değil.

source: Average Rating
tr: Ortalama Derecelendirme

source: Brands/Sellers
tr: Markalar/Satıcılar

# cancelButton
source: Cancel
tr: İptal

# cancelledStatus
source: Cancelled
tr: İade Edildi

# cardInfo
source: Tap the cards to Reveal More
tr: Daha Fazlası İçin Kartlara Dokun

source: Close
tr: Kapat

# codeSentToEmail
source: A verification code has been sent to:
tr: Doğrulama kodu e-posta adresinize gönderildi:

source: Competitive Landscape
tr: Rekabet Ortamı

# confirmPassword
source: Please confirm your password
tr: Lütfen şifrenizi tekrar girin

# contactInfoTitle
source: Contact Info
tr: İletişim Bilgileri

source: Copied!
tr: Kopyalandı!

# copyError
source: Cannot Copied
tr: Kopyalanamadı

# createAccount
source: Create your account
tr: Hesabınızı oluşturun

# customerLabel
source: Customer
tr: Müşteri

# dateLabel
source: Date
tr: Tarih

# deliveredStatus
source: Delivered
tr: Teslim Edildi

# differentProductCountLabel
source: Number of Product Types
tr: Ürün Çeşidi Sayısı

# ecoBotInfoLabel
source: What's EcoBot?
tr: EcoBot Nedir?

# ecoBotInfoMessage
source: EcoBot is an intelligent assistant designed to provide you with daily tips and insights related to e-commerce, sustainability, and conscious lifestyle habits. Powered by Google's Gemini AI, EcoBot generates fresh, inspiring suggestions tailored to help you live and shop more responsibly. This assistant is a core feature of the EcoMarket app, envisioned and developed by Ozan Uslan, with the goal of making sustainability more accessible and actionable in everyday life. EcoBot continuously learns from your preferences and delivers meaningful, eco-friendly recommendations to guide your journey toward a more conscious lifestyle. 👉 EcoBot is always here to help you make better, greener choices—every single day.
tr: EcoBot, e-ticaret, sürdürülebilirlik ve bilinçli yaşam alışkanlıkları üzerine günlük ipuçları ve öneriler sunmak için tasarlanmış akıllı bir asistandır. Google’ın Gemini yapay zekâsı tarafından desteklenen EcoBot, kullanıcıya özel, ilham verici ve sürdürülebilir yaşamı destekleyen öneriler üretir. EcoBot, Ozan Uslan tarafından geliştirilen EcoMarket uygulamasının temel bir özelliğidir. Amacı, sürdürülebilirliği günlük hayatın bir parçası hâline getirmek ve kullanıcıların daha bilinçli tercihler yapmasına yardımcı olmaktır. Tercihlerinizi öğrenen EcoBot, çevre dostu yaşam tarzına doğru atacağınız adımlarda size yol gösterir. 👉 EcoBot, her gün daha iyi ve daha yeşil kararlar almanız için daima yanınızda.

# ecoBotSuggestion
source: Suggestion From EcoBot
tr: EcoBot'tan Bugünkü Öneri

# ecoBotTalkHint
source: Write to talk
tr: Konuşmak için yaz

# ecoProductFallBack
source: Oops! Something went wrong while improving the product.
tr: Oops! Ürün geliştirmesi yapılırken bir sorun oluştu. Lütfen tekrar deneyin.

# ecoProductHint1
source: Your product name, printed t-shirt...
tr: Ürününüzün adı, baskılı tişört...

# ecoProductHint2
source: Rubber, printed phone case...
tr: Kauçuk, baskılı telefon kılıfı...

# ecoProductHint3
source: Plastic, wood, silver...
tr: Plastik, ahşap, gümüş...

# ecoProductHint4
source: Global, Turkey, Russia...
tr: Global, Türkiye, Rusya...

# ecoProductIsDone
source: Eco Improvements are Ready!
tr: Eco Ürün Geliştirmeleri Hazır!

# ecoProductQuestionDescription
source: Can you describe the product?
tr: Ürünü tanımlayabilir misin?

# ecoProductQuestionMaterial
source: What material or materials is the product made of?
tr: Ürün hangi malzeme ya da malzemelerden yapılmıştır?

# ecoProductQuestionName
source: What is the name of the product?
tr: Ürünün adı nedir?

# ecoProductQuestionTarget
source: Which country or countries is the product intended to be sold in?
tr: Ürünün satışının hedeflendiği ülke veya ülkeler hangileri?

# ecoProductSubtitle
source: EcoBot helps you renew, improve, and make your products more environmentally friendly
tr: EcoBot ürünlerini yenilemekte, geliştirmekte ve çevre dostu yapamakta sana yardımcı olur

# ecoProductTitle
source: More Eco-Friendly Products
tr: Daha Çevreci Ürünler

# ecoProductWelcomeText
source: Ready to improve your product with EcoBot? Just tell me your product’s name, description, materials, and the country you plan to sell in — we’ll take it from there. Our goal is to make your product more eco-friendly and competitive. EcoBot will be your development assistant: it will ask a few questions, analyze the details, and give tailored suggestions to enhance your product and reduce its environmental impact. If you're ready, let's begin and take a solid step toward a more sustainable product!
tr: EcoBot ile birlikte ürününü geliştirmeye hazır mısın? Bana ürünün adını, açıklamasını, materyallerini ve satış yapmayı planladığın ülkeyi ver — gerisini birlikte halledelim. Amacımız, ürününü daha çevreci ve rekabetçi hale getirmek. EcoBot senin geliştirme asistanın olacak: sana birkaç soru soracak, ardından analiz yaparak çevresel etkileri azaltmaya ve ürününü iyileştirmeye yönelik öneriler sunacak. Hazırsan, başlayalım ve daha sürdürülebilir bir ürüne birlikte adım atalım!

# email
source: E-mail Address
tr: E-posta Adresi

# enterCode
source: Please enter the verification code
tr: Lütfen doğrulama kodunu girin

# enterEmail
source: Enter Your Email
tr: E-postanızı Girin

# enterEmailForReset
source: Please enter your email address to receive a verification code.
tr: Doğrulama kodu almak için lütfen e-posta adresinizi girin.

# enterName
source: Please enter your name
tr: Lütfen adınızı girin

# enterPassword
source: Enter Your Password
tr: Şifrenizi Girin

# enterSurname
source: Please enter your surname
tr: Lütfen soyadınızı girin

# enterValidEmail
source: Enter a Valid Email
tr: Geçerli Bir E-posta Girin

# enterValidPassword
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalı

source: Existing Products and Prices
tr: Mevcut Ürünler ve Fiyatlar

source: Forgot Password
tr: Şifremi Unuttum

# forgotPasswordTitle
source: Forgot Password
tr: Şifremi Unuttum

# generateNewProductIdeasFallBack
source: Oops! Something went wrong while generating new ideas.
tr: Oops! Yeni fikirler üretilirken bir sorun oluştu. Lütfen tekrar deneyin.

source: Got it
tr: Harika

# graphTitle
source: Graphs
tr: Grafikler

# homeWelcome
source: Welcome to EcoMarket
tr: EcoMarket'e Hoş Geldin

source: Improvement Suggestions
tr: Geliştirme Önerileri

# invalidCode
source: Invalid verification code
tr: Geçersiz doğrulama kodu

source: JSON parsing failed
tr: JSON ayrıştırma başarısız oldu

source: Loading...
tr: Yükleniyor...

# loginTitle
source: Login
tr: Giriş Yap

# loginWithAccount
source: Login to Your Account
tr: Hesabınıza Giriş Yapın

source: Market Demand
tr: Pazar Talebi

# marketResearchFallBack
source: Oops! Something went wrong while doing market research.
tr: Oops! Pazar araştırması yapılırken bir sorun oluştu. Lütfen tekrar deneyin.

# marketResearchHint1
source: Phone Case, Earrings, Sweatshirt...
tr: Telefon Kılıfı, Küpe, Sweatshirt...

# marketResearchHint2
source: Global, America, Philippines...
tr: Global, Amerika, Filipinler

source: Market Research is Done!
tr: Pazar Araştırması Tamamlandı!

# marketResearchQuestionIdeaExplanation
source: What product idea would you like to conduct market research on?
tr: Pazar araştırmasını hangi ürün fikri üzerine yapmak istersin?

# marketResearchQuestionTarget
source: Which country or countries would you like to focus your market research on for this product?
tr: Bu ürün için pazar araştırmasını hangi ülke ya da ülkelerde yapmak istersin?

# marketResearchSubtitle
source: Let's conduct market and price research with EcoBot
tr: EcoBot ile pazar ve fiyat araştırması yapalım

# marketResearchTitle
source: Market Research
tr: Pazar Araştırması

# marketResearchWelcomeText
source: Are you ready to explore the world of e-commerce with EcoBot? Based on your product idea and target country, we'll research whether similar products exist, what their price ranges are, and what trends are shaping the market. Our goal is to provide you with solid insights and help you understand where your idea stands in the market. EcoBot will be your research assistant: it will ask you a few questions, gather and analyze data, and present you with a personalized market report. If you're ready, let's begin and take the first confident step toward bringing your idea to life!
tr: EcoBot ile birlikte e-ticaret pazarını keşfetmeye hazır mısın? Verdiğin ürün fikri ve hedef ülke doğrultusunda, benzer ürünlerin piyasada olup olmadığını, fiyat aralıklarını ve pazar trendlerini birlikte inceleyeceğiz. Amacımız, girişim yolculuğunda sana güçlü veriler sunmak ve fikrinin pazardaki yerini netleştirmek. EcoBot senin araştırma asistanın olacak: sana birkaç soru soracak, ardından verileri toplayıp analiz ederek sana özel bir pazar araştırması sunacak. Hazırsan, başlayalım ve fikrini gerçeğe dönüştürme yolunda sağlam adımlar atalım!

source: Name
tr: Adınız

# newIdeaHint1
source: Clothing, accessories, electronics...
tr: Giyim, aksesuar, elektronik...

# newIdeaHint2
source: Cotton, recycled plastic, glass...
tr: Pamuk, geri dönüştürülmüş plastik, cam...

# newIdeaHint3
source: Global, Turkey, Italy...
tr: Global, Türkiye, İtalya...

# newIdeaHint4
source: High budget, 40,000 $, medium budget...
tr: Yüksek bütçeli, 40.000 TL, orta bütçeli...

# newIdeaHint5
source: No, slightly, maybe...
tr: Hayır, biraz, olabilir...

# newIdeaIsDone
source: Your ideas are ready!
tr: Fikirlerin Hazır!

# newIdeasSubtitle
source: Set sail for new ideas with EcoBot
tr: EcoBot ile beraber yeni fikirlere yelken aç

# newIdeasTitle
source: New Ideas
tr: Yeni Ürün Fikirleri

# newIdeasWelcomeText
source: How about designing the next generation of e-commerce products together with EcoBot? With your ideas, you can help make the world a more sustainable place. Our goal is to develop eco-friendly, innovative, and inspiring e-commerce product ideas. EcoBot will be your guide: it will ask questions and help you shape your vision. If you're ready, start answering and let's build the future together!
tr: EcoBot ile birlikte geleceğin yeni e-ticaret ürünlerini tasarlamaya ne dersin? Yeni fikirlerinle dünyayı daha sürdürülebilir bir yer hâline getirmeye yardımcı olabilirsin. Amacımız, çevre dostu, yenilikçi ve ilham verici e-ticaret ürün fikirleri geliştirmek. EcoBot senin rehberin olacak: sana sorular soracak, fikirlerini şekillendirmen için yol gösterecek. Hazırsan, şimdi cevaplarla vizyonunu paylaş ve geleceği birlikte inşa edelim!

# newIdeaQuestionBudget
source: What will be the product's budget?
tr: Ürünün bütçesi ne olacak?

# newIdeaQuestionCategory
source: What will be the product category or categories?
tr: Ürünün kategorisi ya da kategorileri ne olacak?

# newIdeaQuestionCountry
source: What will be the target country or countries for the product?
tr: Ürünün hedef ülke ya da ülkeleri neresi olacak?

# newIdeaQuestionIsEco
source: Will the product be eco-friendly? If so, to what extent?
tr: Ürün çevre dostu olacak mı? Olacaksa ne düzeyde olacak?

# newIdeaQuestionMaterial
source: What will be the product material or materials?
tr: Ürünün materyali ya da materyalleri ne olacak?

# newPrice
source: Enter the New Price
tr: Yeni Fiyatı Giriniz

source: No
tr: Hayır

# noAccount
source: Don't Have an Account?
tr: Hesabınız Yok mu?

source: No Address
tr: Adres Yok

# noSave
source: Don't Save
tr: Kaydetmeden Çık

# noSpecificProductInfo
source: No specific product information found.
tr: Belirli bir ürün bilgisi bulunamadı.

# noSuggestion
source: No suggestion available
tr: Uygun öneri bulunamadı

# noWeaknessesFound
source: No Weakness
tr: Zayıf Yön Bulunmadı

source: Not Available
tr: Mevcut Değil

source: Overall Sentiment
tr: Genel Duygu

# ozanUslan
source: Powered by Ozan Uslan
tr: Ozan Uslan Tarafından Geliştirildi

# passwordsNotMatch
source: Passwords do not match
tr: Şifreler eşleşmiyor

source: Password
tr: Şifre

# passwordResetSuccess
source: Password reset link sent successfully!
tr: Şifre sıfırlama bağlantısı başarıyla gönderildi!

# phone
source: Phone Number
tr: Telefon Numarasu

source: Price
tr: Fiyat

source: Price Range
tr: Fiyat Aralığı

source: Price Ranges
tr: Fiyat Aralıkları

source: Problematic part
tr: Sorunlu kısım

# productStatusBar
source: Delivered/Cancelled Ratio of Products
tr: Ürünlerin Teslim Edildi/İptal Edildi Oranı

source: Products
tr: Ürünler

# processesLabel
source: Products Process Status
tr: Ürünlerin İşlem Durumu

# profileTitle
source: Profile Page
tr: Profil Sayfası

# quantityLabel
source: Quantity
tr: Miktar

source: Rating Summary
tr: Derecelendirme Özeti

source: Restart
tr: Yeniden Başla

source: Risks and Limitations
tr: Riskler ve Sınırlamalar

source: Save
tr: Kaydet

source: See the improved product
tr: Geliştirilmiş ürünü gör

# seeTheMarketResearch
source: See the Market Resarch Results
tr: Market Araştırması sonuçlarını Gör

source: See the New Ideas
tr: Yeni Fikirleri Gör

# sellerInfoTitle
source: Sales Info
tr: Satış Bilgileri

# sendCodeButton
source: Send Code
tr: Kod Gönder

# sendMessageFallback
source: Oops! Something went wrong while generating message.
tr: Mesaj oluşturulurken bir hata oldu.

source: Sign Up
tr: Üye Ol

# signInCancelled
source: Login is Cancelled
tr: Giriş İptal Edildi

# signInFailed
source: Login Failure
tr: Giriş Başarısız

# signInSuccess
source: Login is Successful
tr: Başarılı Giriş

# signInWithGoogle
source: Login with Google
tr: Google ileGiriş Yap

# similarProductsAndMarketplaces
source: Similar Products & Marketplaces
tr: Benzer Ürünler ve Pazaryerleri

source: Similar Products Available
tr: Benzer Ürünler Mevcut Mu?

# soldProductGraph
source: Sold Products Pie Graph
tr: Satılan Ürünler Pasta Grafiği

source: Star Rating Breakdown
tr: Yıldız Derecelendirme Dağılımı

source: Strengths
tr: Güçlü Yönler

# summarizeCommentsButton
source: See the Analysis
tr: Analizi Gör

# summarizeFeedbackFallBack
source: Oops! Something went wrong while analyzing customer comments.
tr: Oops! Müşteri yorumları analiz edilirken bir sorun oluştu. Lütfen tekrar deneyin.

# summarizeFeedbackIsDone
source: Product Comments Analysis is Done!
tr: Ürün Yorumları Analizi Hazır!

# summarizeFeedbackWelcomeText
source: EcoBot will now analyze customer feedback (comments and scores) about the product you selected. It will summarize the comments to highlight the product’s strengths and weaknesses, and provide suggestions for improvement based on real user experiences. Our goal is to enhance the user experience and make the product more sustainable by minimizing its environmental impact. If you're ready, let's take your product to the next level with the help of user feedback!
tr: EcoBot şimdi seçtiğin ürünle ilgili yapılan müşteri yorumlarını analiz edecek. Yorumları özetleyerek ürünün güçlü ve zayıf yönlerini senin için ortaya koyacak. Ayrıca, müşterilerden gelen geri bildirimlere dayanarak ürünü nasıl geliştirebileceğine dair öneriler sunacak. Hedefimiz, kullanıcı deneyimini artırmak ve çevresel etkileri en aza indirecek şekilde ürünü daha sürdürülebilir hale getirmek. Hazırsan, kullanıcı görüşlerinden yola çıkarak ürününü bir adım öteye taşıyalım!

source: Surname
tr: Soyadınız

# talkToEcoBot
source: Tap to Talk with EcoBot
tr: EcoBot ile konuşmak için dokun

# targetCountriesLabel
source: Available Countries
tr: Satış Yapılabilen Ülkeler

source: Target Customer Segments
tr: Hedef Müşteri Segmentleri

# top5customers
source: Top 5 Customers Who Purchased the Most
tr: En Çok Alım Yapan 5 Müşteri

source: Trends and Growth Pattern
tr: Trendler ve Büyüme Modeli

# userFeedbackSubtitle
source: EcoBot analyzes the comments and ratings of your selected product
tr: EcoBot senin için kullanıcıların yorumlarını ve isteklerini analiz eder

# userFeedbackTitle
source: Analysis of Customer Comments
tr: Kullanıcı Yorumlarının Analizi

source: Username
tr: Kullanıcı Adı

source: Verification Code
tr: Doğrulama Kodu

# verifyButton
source: Verify
tr: Doğrula

# verifyCodeTitle
source: Verify Code
tr: Doğrulama Kodu

source: Welcome
tr: Hoş Geldin

source: Weaknesses
tr: Zayıf Yönler

source: Yes
tr: Evet

source: No Response
tr: Cevap alınamadı
